NextFOAM-2602/tutorials/multiphase/interFoam/RAS/damBreakLeakage/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    rightWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    lowerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }

    "(porous_half0|porous_half1)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
